import { AccommodationDetailData } from '../types'
import { chaletImages, scandiImages, spaImages } from '@/helpers/get-detailed-images-by-folder'

export const chaletData: AccommodationDetailData = {
  images: chaletImages,
  number: 1,
  title: 'Chalet-дом',
  description:
    'Уютный двухэтажный дом в окружении соснового леса, идеально подходит для компании до 7 гостей. Здесь есть всё для комфортного отдыха, уединения или уютного вечера с близкими.\n' +
    '\n' +
    'В доме:\n' +
    '— Два этажа, на каждом — спальня, санузел и полноценная кухня с набором посуды и всей необходимой техникой\n' +
    '— Панорамная терраса с камином на первом этаже, где приятно встречать рассветы и провожать закаты\n' +
    '— Большая уличная мангальная зона под крышей\n' +
    '— Атмосферный балкон с креслами на втором этаже,  для чтения и отдыха с чашкой чая\n' +
    '— Система отопления и кондиционирования на обоих этажах\n' +
    '— Всё необходимое для комфортного размещения до 7 гостей\n' +
    '— Текстиль высокого качества\n' +
    '— Возможность комфортного отдыха в любую погоду\n' +
    '— Два TV\n' +
    '— Безлимитный Wi-Fi\n' +
    '\n' +
    'Кухня укомплектована:\n' +
    '— Варочная панель, духовой шкаф\n' +
    '— Капсульная кофемашина Nespresso\n' +
    '— Посудомоечная машина, холодильник с морозильной камерой\n' +
    '— Микроволновая печь\n' +
    '— Полный набор посуды: тарелки, бокалы, салатницы, кастрюли, сковородки, форма для запекания\n' +
    '\n' +
    'Спальные зоны:\n' +
    '— Просторные кровати с ортопедическим матрасом\n' +
    '— Белоснежное постельное бельё\n' +
    '— Подушки из натурального пуха и пера\n' +
    '— Воздушные одеяла\n' +
    '\n' +
    'Дополнительные спальные места:\n' +
    '— На 1 этаже: отдельная комната с диваном-кроватью на 1,5 спальных места\n' +
    '— На 2 этаже: в гостиной большой диван-кровать на 2 спальных места\n' +
    '— Каждое место укомплектовано постельным бельём\n' +
    '\n' +
    'Санузлы:\n' +
    '— На 1 этаже: туалет и душевая зона\n' +
    '— На 2 этаже: туалет и просторная винтажная ванна в стиле «Прованс» с видом из окна\n' +
    '— Полотенца, фен\n' +
    '\n' +
    'Уличная мангальная зона под крышей:\n' +
    '— Большой стол на 12 человек\n' +
    '— Кухонный остров для приготовления пищи\n' +
    '— Русская печь\n' +
    '— Газовая плита\n' +
    '— Большой мангал\n' +
    '— Вся необходимая посуда\n' +
    '— Решётки, шампура, дрова\n' +
    '\n' +
    'Приятные возможности:\n' +
    '— Посидеть с бокальчиком вина у камина\n' +
    '— Попить кофе или травяной чай на террасе\n' +
    '— Приготовить вкусную еду на углях\n' +
    '— Поиграть в настольные игры\n' +
    '— Сделать атмосферные фотографии на память\n' +
    '\n' +
    'Правила:\n' +
    '— Курение в доме запрещено\n' +
    '— Размещение с воспитанными питомцами возможно по согласованию\n'
}

export const spaData: AccommodationDetailData = {
  images: spaImages,
  number: 2,
  title: 'SPA-дом у реки',
  description:
    'Перед вами уникальный двухэтажный дом с креативным дизайном и атмосферой абсолютного уединения. Дом с семиметровыми потолками, большими панорамными окнами, зимним садом и настоящим Spa-комплексом внутри.\n' +
    '\n' +
    'Здесь легко устроить романтический отдых, ретрит, вечеринку с караоке, мастер-класс, девичник, фотосессию или даже киносъёмку.\n' +
    '\n' +
    'Всего в 10 метрах от дома — река Носовка, где можно наблюдать диких уток и аистов.\n' +
    '\n' +
    'Дом вмещает до 4-х гостей и до 12 гостей для дневного посещения.\n' +
    '\n' +
    'В доме:\n' +
    '— Два этажа с просторными и функциональными зонами\n' +
    '—  Индивидуальная система подсветки по всему дому\n' +
    '— Панорамные окна и гостиная с камином на первом этаже\n' +
    '— Уникальная SPA-зона в вашем доме (входит в стоимость)\n' +
    '— Зимний сад с живыми растениями на втором этаже\n' +
    '— Ultra HD (4K) LED телевизор с диагональю ~2 м \n' +
    '— Караоке-системой с радиомикрофонами\n' +
    '— Система отопления и кондиционирования на обоих этажах\n' +
    '— Подогрев полов\n' +
    '— Текстиль высокого качества\n' +
    '— Возможность комфортного отдыха в любую погоду\n' +
    '— Безлимитный Wi-Fi\n' +
    '\n' +
    'Кухня укомплектована:\n' +
    '— Кухонный остров длиной более 3 метров, рассчитанный на комфортное размещение до 12 гостей\n' +
    '— Электрическая варочная панель, СВЧ-печь\n' +
    '— Посудомоечная машина\n' +
    '— Холодильник с морозильной камерой\n' +
    '— Винный шкаф\n' +
    '— Кофемашина Nespresso, электрический чайник\n' +
    '— Полный набор посуды для приготовления и сервировки\n' +
    '\n' +
    'Спальные зоны:\n' +
    '— Кровать super king-size с ортопедическим матрасом\n' +
    '— Белоснежное постельное бельё\n' +
    '— Подушки из искусственного лебяжьего пуха\n' +
    '— Воздушные одеяла\n' +
    '\n' +
    'Дополнительные спальные места:\n' +
    '— Огромный раскладной диван на втором этаже\n' +
    '— Укомплектован постельным бельём\n' +
    '\n' +
    'SPA-зона:\n' +
    '— Финская дровяная сауна на 8 человек\n' +
    '— Хамам в римском стиле\n' +
    '— Душ с обливным ведром\n' +
    '— Массажный стол\n' +
    '— Полный банный набор: веники, масла, халаты, тапочки, полотенца, паштемали\n' +
    '— Хромотерапия (цвето-световое воздействие)\n' +
    '— Санузел и душевая\n' +
    '— Уличная купель с подогревом, аэромассажем и функцией хромотерапии (оплачивается отдельно)\n' +
    '\n' +
    'Санузлы:\n' +
    '— На 1 этаже: санузел, душевая зона, доступ к SPA-зоне\n' +
    '— Полотенца, фен\n' +
    '\n' +
    'Приятные возможности:\n' +
    '— Посидеть у камина с бокалом вина\n' +
    '— Попить кофе или травяной чай на террасе\n' +
    '— Попеть караоке\n' +
    '— Провести время в SPA, не выходя из дома\n' +
    '— Поиграть в настольные игры\n' +
    '— Сделать атмосферные фотографии\n' +
    '\n' +
    'Правила:\n' +
    '— Курение в доме запрещено\n' +
    '— Размещение с воспитанными питомцами — по согласованию'
}

export const scandiData: AccommodationDetailData = {
  images: scandiImages,
  number: 3,
  title: 'Scandi-дом',
  description:
    'Арт-дом в сосновом бору\n' +
    'Перед вами дизайнерский дом в стиле арт-объекта, созданный для эстетичного и комфортного отдыха.\n' +
    '\n' +
    'Здесь нет городского шума, нет соседей за стенкой — только вы, природа и продуманный до мелочей интерьер.\n' +
    'Этот дом идеально подойдёт для уединённых выходных, стильной фотосессии, романтического вечера или небольшой перезагрузки наедине с собой.\n' +
    '\n' +
    'Дом расположен рядом с сосновым бором, с чистым воздухом и ощущением абсолютного покоя.\n' +
    '\n' +
    'Дом рассчитан на комфортное размещение до 4 гостей.\n' +
    '\n' +
    'В доме:\n' +
    '— Панорамные окна и естественное освещение\n' +
    '— Кондиционер и климат-контроль\n' +
    '— Полностью укомплектованный дом\n' +
    '— Кухня с техникой и посудой\n' +
    '— Стильное пространство, созданное с вниманием к деталям\n' +
    '— Уютный дизайн с мягкой мебелью\n' +
    '— Арт-интерьер, подходящий для съёмок и фотосессий\n' +
    '— Отдельная кухня и обеденная зона\n' +
    '— Чистота и комфорт, как в хорошем отеле\n' +
    '— Безлимитный Wi-Fi\n' +
    '\n' +
    '\n' +
    'Кухня укомплектована:\n' +
    '— Варочная панель, холодильник, электрический чайник\n' +
    '— Полный набор посуды для приготовления и сервировки\n' +
    '\n' +
    'Спальные зоны:\n' +
    '— Двуспальная кровать\n' +
    '— Подушки, одеяла, постель из натуральных тканей\n' +
    '— Тепло, тишина и уют\n' +
    '\n' +
    'Дополнительные спальные места:\n' +
    '— Раскладной диван на 1–2 человек\n' +
    '— Укомплектован постельным бельём\n' +
    '\n' +
    'Санузел:\n' +
    '— Душевая зона с горячей водой\n' +
    '— Полотенца, фен\n' +
    '\n' +
    'Приятные возможности:\n' +
    '— Провести незабываемые выходные \n' +
    '— Прогуляться по лесу\n' +
    '— Провести уютные вечера под пледом и с бокалом вина\n' +
    '— Поиграть в настольные игры\n' +
    '\n' +
    'Правила:\n' +
    '— Курение в доме запрещено\n' +
    '— Размещение с воспитанными питомцами — по согласованию'
}
